feat: add managed services
